src/cf/Catalogs/Резолюции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Резолюции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторРезолюции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнесРезолюцию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРезолюции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУчастника</Name>
					<Comment>Идентификатор участника действия</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияИсполнения</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.Рассмотрение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстРезолюции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФактическиеИсполнители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РаботаСРезолюциямиКлиент/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ ДЛЯ РАБОТЫ С РЕЗОЛЮЦИЯМИ (КЛИЕНТ)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ДобавитьРезолюцию(ЭтаФорма) Экспорт
	
	ДокументСсылка = ЭтаФорма.Объект.Ссылка;
	
	Если ДокументСсылка.Пустая() Тогда 
		Если Не ЭтаФорма.Записать() Тогда 
			Возврат;
		КонецЕсли;
		
		ДокументСсылка = ЭтаФорма.Объект.Ссылка;
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Создание:'"), 
			ПолучитьНавигационнуюСсылку(ДокументСсылка),
			Строка(ДокументСсылка),
			БиблиотекаКартинок.Информация32);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ", ДокументСсылка);
	ОткрытьФорму("Справочник.Резолюции.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

Процедура УдалитьРезолюцию(ЭтаФорма, ОписаниеОповещенияВозврата) Экспорт
	
	Резолюция = Неопределено;
	
	Если ЭтаФорма.Резолюции.Количество() = 1 Тогда
		Резолюция = ЭтаФорма.Резолюции[0].Ссылка;
	ИначеЕсли ЭтаФорма.Резолюции.Количество() > 1 Тогда
		
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("ЭтаФорма", ЭтаФорма);
		ПараметрыОбработчика.Вставить("ОписаниеОповещенияВозврата", ОписаниеОповещенияВозврата);
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"УдалитьРезолюцияПослеВыбора",
			ЭтотОбъект,
			ПараметрыОбработчика);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ЭтаФорма.Объект.Ссылка);
		ПараметрыФормы.Вставить("ПоказыватьУдаленныеРезолюции", ЭтаФорма.ПоказыватьУдаленныеРезолюции);
		ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Выберите резолюцию для удаления'"));
		ОткрытьФорму(
			"Справочник.Резолюции.ФормаВыбора",
			ПараметрыФормы,
			ЭтаФорма,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Возврат;
		
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ЭтаФорма", ЭтаФорма);
	Параметры.Вставить("ОписаниеОповещенияВозврата", ОписаниеОповещенияВозврата);
	УдалитьРезолюцияПослеВыбора(Резолюция, Параметры);
	
КонецПроцедуры

Процедура УдалитьРезолюцияПослеВыбора(ВыбраннаяРезолюция, Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбраннаяРезолюция) Тогда 
		Возврат;
	КонецЕсли;
	
	ЭтаФорма = Параметры.ЭтаФорма;
	ОписаниеОповещения = Параметры.ОписаниеОповещенияВозврата;
	
	РеквизитыРезолюции = ОбщегоНазначенияДокументооборотВызовСервера.ЗначенияРеквизитовОбъекта(ВыбраннаяРезолюция,
		"Документ, Источник, ПометкаУдаления");
	Документ = РеквизитыРезолюции.Документ;
	Источник = РеквизитыРезолюции.Источник;
	ТекущаяПометкаУдаления = РеквизитыРезолюции.ПометкаУдаления;
	
	Если Не РаботаСРезолюциями.ЭтоАвторРезолюции(ВыбраннаяРезолюция) Тогда
		ТекстПредупреждения = НСтр("ru = 'Удалить резолюцию может только автор или пользователь, который ее внес.'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник) Тогда 
		ТекстПредупреждения = НСтр("ru = 'Нельзя удалить резолюцию, добавленную при выполнении процесса ""Рассмотрение"".'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если ТекущаяПометкаУдаления Тогда
		ТекстВопроса = НСтр("ru = 'Снять с резолюции пометку на удаление?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Пометить резолюцию на удаление?'");
	КонецЕсли;
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ОписаниеОповещения", ОписаниеОповещения);
	ПараметрыОбработчика.Вставить("Резолюция", ВыбраннаяРезолюция);
	ПараметрыОбработчика.Вставить("ТекущаяПометкаУдаления", ТекущаяПометкаУдаления);
	ПараметрыОбработчика.Вставить("Документ", Документ);
	ОписаниеОповещенияОтветаНаВопрос = Новый ОписаниеОповещения(
		"УдалитьРезолюциюПродолжение",
		ЭтотОбъект,
		ПараметрыОбработчика);
	ПоказатьВопрос(ОписаниеОповещенияОтветаНаВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура УдалитьРезолюциюПродолжение(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПометкаИзменена = РаботаСРезолюциями.УстановитьПометкуНаУдаление(
		Параметры.Резолюция,
		НЕ Параметры.ТекущаяПометкаУдаления);
	
	Если ПометкаИзменена Тогда
		Если Параметры.ТекущаяПометкаУдаления Тогда
			Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Пометка на удаление с резолюции к документу ""%1"" успешно снята.'"),
				Параметры.Документ));
		Иначе
			Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Пометка на удаление успешно установлена для резолюции к документу ""%1"".'"),
				Параметры.Документ));
		КонецЕсли;
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещения);	
	Иначе
		Если Параметры.ТекущаяПометкаУдаления Тогда
			ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось снять пометку на удаление с резолюции к документу ""%1"".'"),
				Параметры.Документ);
		Иначе
			ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось установить пометку на удаление для резолюции к документу ""%1"".'"),
				Параметры.Документ);
		КонецЕсли;
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНажатииСтатусПроверкиЭП(ЭтаФорма) Экспорт
	
	Резолюция = ПолучитьТекущуюРезолюцию(ЭтаФорма);
	РаботаСЭПКлиент.ОткрытьПодпись(Резолюция, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекущуюРезолюцию(ЭтаФорма)
	
	Если ЭтаФорма.Резолюции.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли ЭтаФорма.Резолюции.Количество() = 1 Тогда
		Возврат ЭтаФорма.Резолюции[0];
	Иначе
		Возврат ЭтаФорма.Элементы.Резолюции.ТекущиеДанные;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
